[
  {
    "id": 1,
    "title": "Atomic Habits",
    "author": "James Clear",
    "description": "Atomic Habits explores how tiny changes can lead to significant results over time. James Clear delves into the science of habit formation, explaining the processes that shape our daily behaviors. He introduces the four laws of behavior change and offers practical steps to build good habits and break bad ones. Through real-life examples and actionable advice, Clear demonstrates how small, consistent actions can help achieve big goals, making this book a valuable guide for anyone seeking personal growth and lasting change.",
    "price": 18.99,
    "stars": 4.8,
    "category": "Self-Help",
    "publisher": "Avery",
    "isbn": "978-0735211292",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91bYsX41DVL.jpg"
  },
  {
    "id": 2,
    "title": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "description": "Mark Manson challenges the conventional self-help advice with a bold approach that emphasizes the importance of embracing life's struggles. He argues that not everything is worth caring about and that focusing on what truly matters leads to a more meaningful life. Manson encourages readers to accept their limitations, face difficult truths, and prioritize their values. By rejecting the pursuit of constant positivity, this book offers a refreshing perspective on personal development and living authentically in a world obsessed with success.",
    "price": 16.99,
    "stars": 4.5,
    "category": "Self-Help",
    "publisher": "Harper",
    "isbn": "978-0062457714",
    "img": "https://images-na.ssl-images-amazon.com/images/I/71QKQ9mwV7L.jpg"
  },
  {
    "id": 3,
    "title": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "description": "Where the Crawdads Sing is set in the marshlands of North Carolina and tells the story of Kya Clark, an abandoned girl who learns to survive on her own in the wild. Isolated from society, Kya finds comfort in nature but becomes the prime suspect when a local man is found dead. Blending a coming-of-age narrative with a murder mystery, Delia Owens weaves a haunting tale of survival, resilience, and the longing for connection. The novel explores themes of loneliness, prejudice, and the healing power of the natural world.",
    "price": 14.99,
    "stars": 4.7,
    "category": "Fiction",
    "publisher": "G.P. Putnam's Sons",
    "isbn": "978-0735219106",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81WWiiLgHPL.jpg"
  },
  {
    "id": 4,
    "title": "Becoming",
    "author": "Michelle Obama",
    "description": "Becoming is Michelle Obama's deeply personal memoir that takes readers from her childhood in Chicago to her role as First Lady of the United States. She shares her experiences of balancing her career, motherhood, and public life, offering insights into her journey of self-discovery. Obama reflects on the challenges she faced, her triumphs, and the moments that defined her. Through candid storytelling, she invites readers to explore the power of resilience and authenticity, making this memoir a compelling read for those seeking inspiration.",
    "price": 19.99,
    "stars": 4.8,
    "category": "Biography",
    "publisher": "Crown",
    "isbn": "978-1524763138",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81h2gWPTYJL.jpg"
  },
  {
    "id": 5,
    "title": "Educated",
    "author": "Tara Westover",
    "description": "Educated is the memoir of Tara Westover, who grew up in a strict and isolated environment without formal education. Despite her upbringing in rural Idaho under survivalist parents, Tara taught herself enough to gain admission to Brigham Young University. Her pursuit of education takes her beyond the confines of her family’s beliefs, eventually leading her to earn a PhD from Cambridge. This powerful narrative explores themes of identity, family loyalty, and the transformative power of education, making it a remarkable story of self-invention and perseverance.",
    "price": 15.99,
    "stars": 4.7,
    "category": "Memoir",
    "publisher": "Random House",
    "isbn": "978-0399590504",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81WojUxbbFL.jpg"
  },
  {
    "id": 6,
    "title": "The Silent Patient",
    "author": "Alex Michaelides",
    "description": "The Silent Patient is a gripping psychological thriller that centers on Alicia Berenson, a renowned artist who suddenly stops speaking after being accused of murdering her husband. Her silence turns the case into a media sensation, and psychotherapist Theo Faber becomes determined to unravel the mystery behind her muteness. As Theo delves deeper into Alicia’s life, he uncovers shocking truths that blur the lines between obsession, art, and madness. The novel masterfully explores the complexities of human psychology, making it an unputdownable read.",
    "price": 14.99,
    "stars": 4.6,
    "category": "Thriller",
    "publisher": "Celadon Books",
    "isbn": "978-1250301697",
    "img": "https://images-na.ssl-images-amazon.com/images/I/71KuwpOJcEL.jpg"
  },
  {
    "id": 7,
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "description": "The Alchemist is a philosophical tale about Santiago, a shepherd boy who dreams of finding a hidden treasure in the Egyptian pyramids. Guided by dreams and omens, Santiago embarks on a journey of self-discovery that teaches him about the importance of following one’s personal legend. Along the way, he encounters various characters who help him understand that true treasure lies not in material wealth, but in pursuing one’s true purpose. Paulo Coelho’s timeless narrative emphasizes faith, perseverance, and the transformative power of dreams.",
    "price": 16.99,
    "stars": 4.7,
    "category": "Fiction",
    "publisher": "HarperOne",
    "isbn": "978-0062315007",
    "img": "https://images-na.ssl-images-amazon.com/images/I/71aFt4+OTOL.jpg"
  },
  {
    "id": 8,
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "description": "Sapiens offers a comprehensive look at the history of humankind, tracing our evolution from prehistoric ancestors to the modern age. Harari explores how humans have shaped the world through cognitive, agricultural, and scientific revolutions. He examines how these developments have influenced societies, cultures, and our understanding of the human condition. With engaging storytelling and insightful analysis, Sapiens challenges readers to consider the impact of human actions on the planet and the future trajectory of our species.",
    "price": 22.99,
    "stars": 4.6,
    "category": "History",
    "publisher": "Harper",
    "isbn": "978-0062316097",
    "img": "https://images-na.ssl-images-amazon.com/images/I/713jIoMO3UL.jpg"
  },
  {
    "id": 9,
    "title": "The 7 Habits of Highly Effective People",
    "author": "Stephen R. Covey",
    "description": "The 7 Habits of Highly Effective People provides a principle-centered approach to personal and professional effectiveness. Stephen R. Covey emphasizes the importance of integrity, fairness, and ethics in achieving success. The book outlines seven habits that help individuals build character and develop leadership skills, including proactive behavior, goal setting, and prioritization. Covey’s teachings offer a roadmap for overcoming challenges and achieving meaningful goals, making this a timeless guide for anyone seeking to improve their personal and professional lives.",
    "price": 18.99,
    "stars": 4.7,
    "category": "Self-Help",
    "publisher": "Simon & Schuster",
    "isbn": "978-1982137274",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81YGOS11GLL.jpg"
  },
  {
    "id": 10,
    "title": "1984",
    "author": "George Orwell",
    "description": "1984 is George Orwell's dystopian novel that depicts a totalitarian society under the watchful eye of Big Brother. In this world, the government controls every aspect of life, suppressing individuality and manipulating truth. The story follows Winston Smith, a low-ranking Party member who secretly despises the regime and dreams of rebellion. As Winston navigates the oppressive landscape, he faces the brutal reality of a world where freedom is an illusion. Orwell's chilling narrative explores themes of surveillance, censorship, and the consequences of absolute power.",
    "price": 14.99,
    "stars": 4.7,
    "category": "Fiction",
    "publisher": "Secker & Warburg",
    "isbn": "978-0451524935",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81F7MdzOdJL.jpg"
  },
  {
    "id": 11,
    "title": "The Midnight Library",
    "author": "Matt Haig",
    "description": "The Midnight Library explores the endless possibilities of a life not lived. Nora Seed, struggling with regrets and despair, finds herself in the Midnight Library, a magical place where she can explore different versions of her life by making different choices. As she navigates through these alternative realities, Nora learns valuable lessons about happiness, fulfillment, and the importance of embracing life’s uncertainties. Matt Haig's novel is a heartwarming exploration of second chances, self-discovery, and the power of making peace with one's past.",
    "price": 16.99,
    "stars": 4.5,
    "category": "Fiction",
    "publisher": "Viking",
    "isbn": "978-0525559474",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81rp4uyK5zL.jpg"
  },
  {
    "id": 12,
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "description": "Harry Potter and the Sorcerer's Stone introduces readers to the magical world of Hogwarts and the young wizard, Harry Potter. Raised by his cruel aunt and uncle, Harry's life changes when he discovers he is a wizard and is invited to attend Hogwarts School of Witchcraft and Wizardry. There, he makes friends, learns magic, and uncovers secrets about his past and the dark wizard who killed his parents. J.K. Rowling's enchanting tale is the beginning of Harry's journey in a series that has captivated millions around the world.",
    "price": 12.99,
    "stars": 4.9,
    "category": "Fantasy",
    "publisher": "Scholastic",
    "isbn": "978-0439708180",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81YOuOGFCJL.jpg"
  },
  {
    "id": 13,
    "title": "Dune",
    "author": "Frank Herbert",
    "description": "Dune is a science fiction epic set in a distant future where noble families vie for control of the desert planet Arrakis, the only source of a valuable spice called melange. The story follows Paul Atreides, a young nobleman who becomes embroiled in a complex struggle for power, destiny, and survival. As he navigates political intrigue and battles with ruthless foes, Paul discovers his own extraordinary abilities and the true nature of his legacy. Frank Herbert's Dune is a masterful blend of adventure, philosophy, and world-building, making it a cornerstone of the genre.",
    "price": 18.99,
    "stars": 4.6,
    "category": "Science Fiction",
    "publisher": "Ace",
    "isbn": "978-0441013593",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91t9XWPSJhL.jpg"
  },
  {
    "id": 14,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "description": "To Kill a Mockingbird is a classic novel set in the Deep South during the 1930s, exploring themes of racial injustice and moral growth. The story is narrated by Scout Finch, a young girl whose father, Atticus Finch, is a lawyer defending a black man falsely accused of raping a white woman. Through Scout’s eyes, the novel delves into the complexities of human behavior, prejudice, and empathy. Harper Lee’s timeless narrative is a poignant examination of social ethics and the courage required to stand against societal wrongs.",
    "price": 14.99,
    "stars": 4.9,
    "category": "Classics",
    "publisher": "J.B. Lippincott & Co.",
    "isbn": "978-0061120084",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81OthjkJBuL.jpg"
  },
  {
    "id": 15,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "description": "Pride and Prejudice is a romantic novel that explores the themes of love, class, and social expectations in early 19th-century England. The story follows Elizabeth Bennet, a witty and independent young woman, and her evolving relationship with the wealthy and reserved Mr. Darcy. Through misunderstandings, societal pressures, and personal growth, Elizabeth and Darcy learn to overcome their initial prejudices and recognize each other's worth. Jane Austen’s beloved classic is celebrated for its sharp social commentary, enduring characters, and exploration of the human heart.",
    "price": 10.99,
    "stars": 4.8,
    "category": "Classics",
    "publisher": "T. Egerton",
    "isbn": "978-1503290563",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91HHqVTAJQL.jpg"
  },
  {
    "id": 16,
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "description": "The Catcher in the Rye follows the journey of Holden Caulfield, a disenchanted teenager who has just been expelled from his prestigious boarding school. As he wanders the streets of New York City, Holden grapples with the complexities of adolescence, alienation, and his desire to protect the innocence of youth. J.D. Salinger’s novel captures the voice of a young man struggling to find his place in a world that feels phony and oppressive. The book remains a powerful exploration of teenage angst and the search for authenticity in a conformist society.",
    "price": 13.99,
    "stars": 4.4,
    "category": "Classics",
    "publisher": "Little, Brown and Company",
    "isbn": "978-0316769488",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81Oth3gW3TL.jpg"
  },
  {
    "id": 17,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "description": "The Great Gatsby is a classic American novel that explores themes of wealth, love, and the American Dream during the Roaring Twenties. Set in the fictional towns of West Egg and East Egg on Long Island, the story is narrated by Nick Carraway, who becomes entangled in the lavish and mysterious world of his neighbor, Jay Gatsby. As Gatsby pursues his unrequited love for Daisy Buchanan, the novel reveals the dark side of the American Dream and the emptiness of wealth. Fitzgerald’s masterful prose and vivid portrayal of Jazz Age decadence make this novel an enduring literary masterpiece.",
    "price": 11.99,
    "stars": 4.7,
    "category": "Classics",
    "publisher": "Charles Scribner's Sons",
    "isbn": "978-0743273565",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81af+MCATTL.jpg"
  },
  {
    "id": 18,
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "description": "Brave New World is a dystopian novel that imagines a future society driven by technological advancements, genetic engineering, and consumerism. In this world, individuals are conditioned from birth to conform to societal norms and prioritize pleasure over individuality. The story follows Bernard Marx, an outsider who questions the superficial values of his society, and John, a 'savage' who challenges the principles of the brave new world. Aldous Huxley’s cautionary tale explores themes of freedom, control, and the loss of human connection in a technologically driven world.",
    "price": 12.99,
    "stars": 4.6,
    "category": "Science Fiction",
    "publisher": "Chatto & Windus",
    "isbn": "978-0060850524",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81JbT0A0hDL.jpg"
  },
  {
    "id": 19,
    "title": "The Handmaid's Tale",
    "author": "Margaret Atwood",
    "description": "The Handmaid's Tale is a dystopian novel set in a theocratic society where women have no rights and are used as reproductive vessels. The story is narrated by Offred, a handmaid who serves the ruling class by bearing children. As Offred navigates this oppressive world, she recalls memories of her life before the regime and contemplates escape. Margaret Atwood's chilling tale explores themes of power, gender, and resistance, making it a timeless examination of human rights and the dangers of totalitarianism.",
    "price": 14.99,
    "stars": 4.7,
    "category": "Dystopian",
    "publisher": "McClelland and Stewart",
    "isbn": "978-0385490818",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81Kc8NbSeCL.jpg"
  },
  {
    "id": 20,
    "title": "The Book Thief",
    "author": "Markus Zusak",
    "description": "The Book Thief is set in Nazi Germany and follows the story of Liesel Meminger, a young girl who finds solace in stealing books and sharing them with others, including a Jewish man hiding in her foster family's basement. Narrated by Death, the novel explores the power of words, the resilience of the human spirit, and the impact of war on ordinary people. Markus Zusak's poignant tale captures the beauty and brutality of life during one of history's darkest periods, making it a touching tribute to the strength of the human soul.",
    "price": 12.99,
    "stars": 4.8,
    "category": "Historical Fiction",
    "publisher": "Knopf Books for Young Readers",
    "isbn": "978-0375842207",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81OdwZ-9k+L.jpg"
  },
  {
    "id": 21,
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "description": "The Hobbit follows the adventure of Bilbo Baggins, a reluctant hobbit who is swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Accompanied by a group of dwarves and the wizard Gandalf, Bilbo discovers courage and cunning he never knew he had. Along the way, he encounters trolls, goblins, elves, and a mysterious creature named Gollum, who possesses a powerful ring. J.R.R. Tolkien's beloved prelude to The Lord of the Rings is a timeless tale of bravery, friendship, and the joy of discovery.",
    "price": 10.99,
    "stars": 4.8,
    "category": "Fantasy",
    "publisher": "George Allen & Unwin",
    "isbn": "978-0345339683",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91b0C2YNSrL.jpg"
  },
  {
    "id": 22,
    "title": "Moby-Dick",
    "author": "Herman Melville",
    "description": "Moby-Dick is a classic novel that tells the tale of Captain Ahab's obsessive quest to kill the great white whale, Moby Dick. Narrated by Ishmael, a sailor aboard Ahab's ship, the Pequod, the novel explores themes of vengeance, fate, and the relentless pursuit of an elusive goal. As Ahab's obsession grows, the crew becomes entangled in a dangerous game of man versus nature. Herman Melville's epic narrative is a profound exploration of the human condition, the limits of knowledge, and the consequences of unbridled ambition.",
    "price": 9.99,
    "stars": 4.3,
    "category": "Classics",
    "publisher": "Harper & Brothers",
    "isbn": "978-1503280786",
    "img": "https://images-na.ssl-images-amazon.com/images/I/71wK+3M3r3L.jpg"
  },
  {
    "id": 23,
    "title": "War and Peace",
    "author": "Leo Tolstoy",
    "description": "War and Peace is a monumental novel that intertwines the lives of several families against the backdrop of the Napoleonic Wars in early 19th-century Russia. The story explores themes of love, friendship, ambition, and the impact of war on society and individuals. Tolstoy's detailed portrayal of characters such as Pierre Bezukhov, Natasha Rostov, and Prince Andrei Bolkonsky brings to life the complexity of human nature and the struggles of the human spirit. This epic tale is considered one of the greatest works of literature, celebrated for its depth, scope, and emotional resonance.",
    "price": 18.99,
    "stars": 4.5,
    "category": "Classics",
    "publisher": "The Russian Messenger",
    "isbn": "978-0143039990",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91GrXz4E8wL.jpg"
  },
  {
    "id": 24,
    "title": "The Kite Runner",
    "author": "Khaled Hosseini",
    "description": "The Kite Runner is a poignant novel that explores the complexities of friendship, betrayal, and redemption. Set against the backdrop of a changing Afghanistan, the story follows Amir, a young boy from a wealthy family, and Hassan, the son of his father's servant. A devastating betrayal drives a wedge between the two, but years later, Amir returns to his homeland to make amends for his past mistakes. Khaled Hosseini's debut novel is a powerful exploration of the bonds that shape our lives and the lengths we will go to seek forgiveness and redemption.",
    "price": 14.99,
    "stars": 4.8,
    "category": "Fiction",
    "publisher": "Riverhead Books",
    "isbn": "978-1594631931",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81fFMVFGdSL.jpg"
  },
  {
    "id": 25,
    "title": "Anna Karenina",
    "author": "Leo Tolstoy",
    "description": "Anna Karenina is a complex and richly detailed novel that explores themes of love, fidelity, and societal expectations in 19th-century Russia. The story revolves around the passionate and doomed affair between Anna, a married woman, and Count Vronsky, a dashing officer. Their relationship defies social conventions and leads to tragic consequences. Interwoven with their story are the lives of other characters, including the idealistic landowner Levin and his love for the beautiful Kitty. Tolstoy's masterpiece is a profound examination of the human heart, the conflicts of desire and duty, and the harsh realities of a rigid social structure.",
    "price": 15.99,
    "stars": 4.6,
    "category": "Classics",
    "publisher": "The Russian Messenger",
    "isbn": "978-0143035008",
    "img": "https://images-na.ssl-images-amazon.com/images/I/81YkAehSHbL.jpg"
  },
  {
    "id": 26,
    "title": "Frankenstein",
    "author": "Mary Shelley",
    "description": "Frankenstein is a gothic novel that tells the story of Victor Frankenstein, a scientist who creates a living being from body parts of the deceased. Horrified by his own creation, Frankenstein abandons the creature, who is left to fend for himself. The creature's struggle for acceptance and revenge against his creator explores themes of ambition, humanity, and the consequences of playing God. Mary Shelley's tale of horror and science fiction is a cautionary tale about the dangers of unchecked scientific ambition and the ethical responsibilities of creation.",
    "price": 8.99,
    "stars": 4.4,
    "category": "Classics",
    "publisher": "Lackington, Hughes, Harding, Mavor & Jones",
    "isbn": "978-0486282114",
    "img": "https://images-na.ssl-images-amazon.com/images/I/71bXCd8BWBL.jpg"
  },
  {
    "id": 27,
    "title": "The Odyssey",
    "author": "Homer",
    "description": "The Odyssey is an ancient Greek epic poem that chronicles the adventures of Odysseus as he attempts to return home to Ithaca after the Trojan War. Along the way, he encounters mythical creatures, gods, and challenges that test his cunning and resolve. Odysseus' journey is not just a physical one, but a quest for identity and home. The poem explores themes of heroism, loyalty, and the enduring power of human resilience. Homer's timeless tale has captivated audiences for centuries and remains a cornerstone of Western literature.",
    "price": 12.99,
    "stars": 4.5,
    "category": "Classics",
    "publisher": "Various ancient publishers",
    "isbn": "978-0140268867",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91Mwgg19HbL.jpg"
  },
  {
    "id": 28,
    "title": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "description": "Crime and Punishment is a psychological novel that delves into the mind of Raskolnikov, a former student who commits a murder in St. Petersburg. Driven by a belief that some people are above moral law, Raskolnikov struggles with guilt, paranoia, and the consequences of his actions. As he wrestles with his conscience and the possibility of redemption, Dostoevsky explores themes of justice, morality, and the complexity of the human soul. This classic work is a profound exploration of the human psyche and the moral dilemmas that define our existence.",
    "price": 13.99,
    "stars": 4.7,
    "category": "Classics",
    "publisher": "The Russian Messenger",
    "isbn": "978-0486415871",
    "img": "https://images-na.ssl-images-amazon.com/images/I/91F0vnPw.jpg"},
    
      {
        "id": 29,
        "title": "The Catch-22",
        "author": "Joseph Heller",
        "description": "Catch-22 is a satirical novel set during World War II that follows Captain John Yossarian, a U.S. Army Air Force B-25 bombardier who is stationed on a fictional Mediterranean island. The term 'Catch-22' describes the absurd, circular logic of bureaucratic decision-making that traps Yossarian and his fellow airmen. Heller's dark humor and critique of war and its institutions make this novel a classic exploration of the futility and absurdity of conflict, as well as the human desire to survive in the face of unyielding systems.",
        "price": 14.99,
        "stars": 4.6,
        "category": "Classics",
        "publisher": "Simon & Schuster",
        "isbn": "978-1451626650",
        "img": "https://images-na.ssl-images-amazon.com/images/I/91zkq2W4PKL.jpg"
      },
      {
        "id": 30,
        "title": "A Tale of Two Cities",
        "author": "Charles Dickens",
        "description": "A Tale of Two Cities is set in London and Paris before and during the French Revolution. The novel tells the story of the French Dr. Manette, who is released from eighteen years of wrongful imprisonment in the Bastille, and his reunion with his daughter Lucie. It explores themes of sacrifice, resurrection, and the contrast between oppression and freedom. Dickens' portrayal of the turbulent times and his unforgettable characters make this one of his most famous and enduring works, capturing the complexities of love, loss, and redemption.",
        "price": 10.99,
        "stars": 4.4,
        "category": "Classics",
        "publisher": "Chapman & Hall",
        "isbn": "978-1503219700",
        "img": "https://images-na.ssl-images-amazon.com/images/I/91MZc7dIDaL.jpg"
      },
      {
        "id": 31,
        "title": "The Brothers Karamazov",
        "author": "Fyodor Dostoevsky",
        "description": "The Brothers Karamazov is a philosophical novel that explores deep questions about faith, free will, and morality through the lives of the Karamazov brothers: Dmitri, Ivan, Alyosha, and the illegitimate Smerdyakov. The murder of their father, Fyodor Karamazov, sets off a chain of events that tests the limits of their beliefs and their relationships with each other. Dostoevsky's complex characters and profound themes make this novel a masterpiece of Russian literature, examining the darkest and most noble aspects of the human soul.",
        "price": 18.99,
        "stars": 4.7,
        "category": "Classics",
        "publisher": "The Russian Messenger",
        "isbn": "978-0374528379",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71uwxh9B75L.jpg"
      },
      {
        "id": 32,
        "title": "One Hundred Years of Solitude",
        "author": "Gabriel García Márquez",
        "description": "One Hundred Years of Solitude is a magical realist novel that tells the multi-generational story of the Buendía family in the fictional town of Macondo, Colombia. García Márquez weaves a rich tapestry of love, power, tragedy, and magic, blending the ordinary with the extraordinary. The novel explores themes of time, destiny, and the cyclical nature of history, reflecting the complexities of human existence. This iconic work is celebrated for its lush storytelling and profound commentary on Latin American culture and history.",
        "price": 15.99,
        "stars": 4.8,
        "category": "Magical Realism",
        "publisher": "Harper & Row",
        "isbn": "978-0060883287",
        "img": "https://images-na.ssl-images-amazon.com/images/I/81pJb-1FqgL.jpg"
      },
      {
        "id": 33,
        "title": "Jane Eyre",
        "author": "Charlotte Brontë",
        "description": "Jane Eyre is a coming-of-age novel that follows the experiences of its eponymous heroine, from her abusive childhood to her challenging position as a governess at Thornfield Hall, where she meets the enigmatic Mr. Rochester. The novel explores themes of social class, morality, and the struggle for a woman's autonomy in a patriarchal society. Brontë's portrayal of Jane as a strong, intelligent, and independent woman was groundbreaking for its time, making Jane Eyre a seminal work in English literature and a beloved classic.",
        "price": 11.99,
        "stars": 4.7,
        "category": "Classics",
        "publisher": "Smith, Elder & Co.",
        "isbn": "978-0141441146",
        "img": "https://images-na.ssl-images-amazon.com/images/I/91HHqVTAJQL.jpg"
      },
      {
        "id": 34,
        "title": "Les Misérables",
        "author": "Victor Hugo",
        "description": "Les Misérables is a sweeping tale of redemption and revolution set in 19th-century France. The novel follows the journey of Jean Valjean, a former convict who seeks to rebuild his life but is relentlessly pursued by Inspector Javert. Intertwined with Valjean's story are the lives of characters like Fantine, Cosette, and Marius, whose struggles reflect the broader societal conflicts of poverty, justice, and revolution. Hugo's epic masterpiece is celebrated for its rich character development, moral depth, and its powerful depiction of the human spirit's resilience against adversity.",
        "price": 16.99,
        "stars": 4.8,
        "category": "Classics",
        "publisher": "A. Lacroix, Verboeckhoven & Cie",
        "isbn": "978-0451419439",
        "img": "https://images-na.ssl-images-amazon.com/images/I/91tk+XTDqCL.jpg"
      },
      {
        "id": 35,
        "title": "Wuthering Heights",
        "author": "Emily Brontë",
        "description": "Wuthering Heights is a tale of passion, revenge, and the destructive power of love, set on the desolate Yorkshire moors. The novel centers on the intense relationship between Heathcliff, a foundling adopted by the Earnshaw family, and Catherine Earnshaw. Their tumultuous bond drives them to seek revenge on those who wronged them, leading to a legacy of hatred that spans generations. Emily Brontë's only novel is a dark, atmospheric exploration of human emotions, capturing the complexities of love, jealousy, and vengeance in a hauntingly poetic narrative.",
        "price": 9.99,
        "stars": 4.6,
        "category": "Classics",
        "publisher": "Thomas Cautley Newby",
        "isbn": "978-0141439556",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71jLcIHiJaL.jpg"
      },
      {
        "id": 36,
        "title": "Dracula",
        "author": "Bram Stoker",
        "description": "Dracula is a gothic horror novel that tells the story of Count Dracula's attempt to move from Transylvania to England in order to spread the undead curse. Told through a series of journal entries, letters, and newspaper articles, the novel follows a group of people led by Professor Abraham Van Helsing who attempt to thwart Dracula's plans. Stoker's chilling portrayal of the vampire has become one of the most enduring characters in horror fiction, exploring themes of fear, seduction, and the eternal battle between good and evil.",
        "price": 8.99,
        "stars": 4.5,
        "category": "Horror",
        "publisher": "Archibald Constable and Company",
        "isbn": "978-0486411095",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71T88Q49ZPL.jpg"
      },
      {
        "id": 37,
        "title": "Great Expectations",
        "author": "Charles Dickens",
        "description": "Great Expectations is a bildungsroman that chronicles the life of Pip, an orphan who dreams of rising above his humble beginnings. After receiving an unexpected fortune from an unknown benefactor, Pip moves to London, where he learns that wealth and social status are not the keys to happiness. Dickens' novel explores themes of ambition, class, and personal growth, populated by unforgettable characters like the enigmatic Miss Havisham and the proud Estella. Great Expectations is a masterful depiction of the complexities of human desires and the transformative power of kindness.",
        "price": 10.99,
        "stars": 4.7,
        "category": "Classics",
        "publisher": "Chapman & Hall",
        "isbn": "978-0141439563",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71BQ7Uod9oL.jpg"
      },
      {
        "id": 38,
        "title": "The Picture of Dorian Gray",
        "author": "Oscar Wilde",
        "description": "The Picture of Dorian Gray is a philosophical novel that explores the nature of beauty, morality, and the consequences of living a life of indulgence without regard for the repercussions. The story follows Dorian Gray, a handsome young man who sells his soul to remain forever youthful while his portrait ages and reflects the corruption of his actions. As Dorian spirals deeper into decadence, he discovers that escaping the consequences of his choices is impossible. Wilde's only novel is a dark and provocative commentary on vanity, hedonism, and the duality of human nature.",
        "price": 9.99,
        "stars": 4.6,
        "category": "Classics",
        "publisher": "Ward, Lock and Company",
        "isbn": "978-0141439570",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71X5Hdj8%2BKL.jpg"
      },
      {
        "id": 39,
        "title": "The Iliad",
        "author": "Homer",
        "description": "The Iliad is an ancient Greek epic poem that recounts the events of the Trojan War, focusing on the wrath of Achilles, the greatest Greek warrior. The poem explores themes of heroism, honor, and the human cost of war, set against the backdrop of a divine struggle among the gods. Through vivid descriptions of battle, complex character dynamics, and the interplay of fate and free will, The Iliad remains a timeless exploration of the human condition. Homer's portrayal of the Greek and Trojan heroes has captivated readers for millennia.",
        "price": 14.99,
        "stars": 4.6,
        "category": "Classics",
        "publisher": "Various ancient publishers",
        "isbn": "978-0140275360",
        "img": "https://images-na.ssl-images-amazon.com/images/I/81YXeMn%2B2fL.jpg"
      },
      {
        "id": 40,
        "title": "Madame Bovary",
        "author": "Gustave Flaubert",
        "description": "Madame Bovary tells the story of Emma Bovary, a farmer's wife who dreams of a more glamorous life. Dissatisfied with her mundane existence, Emma engages in a series of extramarital affairs and reckless spending in pursuit of her romantic fantasies. Her choices lead to financial ruin and personal tragedy, as Flaubert critiques the emptiness of bourgeois society and the dangers of idealism. Madame Bovary is celebrated for its realistic portrayal of a flawed protagonist and its incisive commentary on the constraints of social convention and the complexities of human desire.",
        "price": 11.99,
        "stars": 4.5,
        "category": "Classics",
        "publisher": "Michel Lévy Frères",
        "isbn": "978-0140449129",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71cD2iStOaL.jpg"
      },
      {
        "id": 41,
        "title": "Mansfield Park",
        "author": "Jane Austen",
        "description": "Mansfield Park is a novel that follows the life of Fanny Price, a poor girl who is sent to live with her wealthy relatives at Mansfield Park. Amidst the opulence and moral laxity of her new surroundings, Fanny remains steadfast in her principles, navigating the complexities of love, family, and social class. Austen's novel explores themes of morality, integrity, and the constraints of societal expectations, offering a sharp critique of the English gentry. Mansfield Park is a subtle yet powerful examination of the power dynamics and human foibles of its era.",
        "price": 10.99,
        "stars": 4.3,
        "category": "Classics",
        "publisher": "Thomas Egerton",
        "isbn": "978-0141439808",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71XLpqJ7F7L.jpg"
      },
      {
        "id": 42,
        "title": "The Count of Monte Cristo",
        "author": "Alexandre Dumas",
        "description": "The Count of Monte Cristo is a tale of adventure, betrayal, and revenge. The novel follows Edmond Dantès, a young sailor who is falsely imprisoned on the eve of his wedding. After escaping from the island fortress of the Château d'If, Dantès discovers a hidden treasure and assumes the identity of the Count of Monte Cristo. He embarks on a mission to exact revenge on those who wronged him, weaving a complex web of intrigue and justice. Dumas' epic story is a thrilling exploration of vengeance, forgiveness, and the limits of human endurance.",
        "price": 18.99,
        "stars": 4.8,
        "category": "Classics",
        "publisher": "Pétion et Cie",
        "isbn": "978-0140449266",
        "img": "https://images-na.ssl-images-amazon.com/images/I/81UHZaiuDTL.jpg"
      },
      {
        "id": 43,
        "title": "Sense and Sensibility",
        "author": "Jane Austen",
        "description": "Sense and Sensibility follows the lives of the Dashwood sisters, Elinor and Marianne, as they navigate love, heartbreak, and the social pressures of Regency England. Elinor embodies 'sense' with her practical and reserved nature, while Marianne represents 'sensibility' with her passionate and impulsive personality. Austen's novel explores themes of love, family, and the tension between reason and emotion, offering a satirical yet empathetic portrayal of the limitations faced by women in a patriarchal society. Sense and Sensibility remains a beloved exploration of the complexities of the human heart.",
        "price": 10.99,
        "stars": 4.6,
        "category": "Classics",
        "publisher": "Thomas Egerton",
        "isbn": "978-0141439662",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71csTR1PUWL.jpg"
      },
      {
        "id": 44,
        "title": "Don Quixote",
        "author": "Miguel de Cervantes",
        "description": "Don Quixote is a satirical novel that follows the adventures of a deluded nobleman who sets out to revive chivalry and become a knight-errant. Accompanied by his loyal squire, Sancho Panza, Don Quixote embarks on a series of misadventures, tilting at windmills and battling imaginary foes. Cervantes' novel is a rich exploration of reality versus illusion, the power of idealism, and the folly of human ambition. Considered one of the greatest works of literature, Don Quixote is a timeless and humorous examination of the human condition.",
        "price": 17.99,
        "stars": 4.7,
        "category": "Classics",
        "publisher": "Francisco de Robles",
        "isbn": "978-0142437230",
        "img": "https://images-na.ssl-images-amazon.com/images/I/81BFTURvU1L.jpg"
      },
      {
        "id": 45,
        "title": "Emma",
        "author": "Jane Austen",
        "description": "Emma is a novel about a wealthy and headstrong young woman who takes it upon herself to play matchmaker in her small English village. Confident in her abilities, Emma Woodhouse meddles in the lives of her friends and neighbors, often with unintended and humorous consequences. As she learns more about herself and the people around her, Emma's journey is one of self-discovery, personal growth, and the realization that love often comes in unexpected forms. Austen's wit and keen social observations make Emma a delightful and enduring classic.",
        "price": 11.99,
        "stars": 4.5,
        "category": "Classics",
        "publisher": "John Murray",
        "isbn": "978-0141439587",
        "img": "https://images-na.ssl-images-amazon.com/images/I/71osgD8kjGL.jpg"
      },
      {
        "id": 46,
        "title": "Gulliver's Travels",
        "author": "Jonathan Swift",
        "description": "Gulliver's Travels is a satirical adventure novel that chronicles the voyages of Lemuel Gulliver, a ship's surgeon who encounters strange and fantastical lands. From the tiny inhabitants of Lilliput to the giants of Brobdingnag, Gulliver's travels are filled with bizarre encounters that serve as a critique of human nature, politics, and society. Swift's sharp wit and imaginative storytelling make this a timeless exploration of the follies and hypocrisies of mankind. Gulliver's Travels remains a classic of English literature, blending satire, adventure, and philosophical insight.",
        "price": 9.99,
        "stars": 4.4,
        "category": "Classics",
        "publisher": "Benjamin Motte",
        "isbn": "978-0141439495",
        "img": "https://images-na.ssl-images-amazon.com/images/I/81v3kFKUzeL.jpg"
      },
    
        {
          "id": 47,
          "title": "The Scarlet Letter",
          "author": "Nathaniel Hawthorne",
          "description": "The Scarlet Letter is a novel set in 17th-century Puritan Massachusetts, exploring themes of sin, guilt, and redemption. The story centers on Hester Prynne, who is publicly shamed and forced to wear a scarlet 'A' on her chest after bearing an illegitimate child. As Hester struggles with her shame and the harsh judgment of society, she finds strength in her independence and compassion. Hawthorne's novel is a powerful exploration of the complexities of moral judgment, the impact of hidden sin, and the human capacity for forgiveness.",
          "price": 10.99,
          "stars": 4.5,
          "category": "Classics",
          "publisher": "Ticknor, Reed & Fields",
          "isbn": "978-0142437261",
          "img": "https://images-na.ssl-images-amazon.com/images/I/81tkBIM5cLL.jpg"
        },
        {
          "id": 48,
          "title": "The Adventures of Huckleberry Finn",
          "author": "Mark Twain",
          "description": "The Adventures of Huckleberry Finn is a novel that follows the journey of a young boy, Huck Finn, and a runaway slave, Jim, as they travel down the Mississippi River on a raft. The novel explores themes of race, freedom, and the moral dilemmas of society through Huck's eyes. Twain's portrayal of friendship, adventure, and the conflict between individual conscience and social norms has made this work a cornerstone of American literature. The novel's rich humor, biting satire, and deep humanity continue to resonate with readers today.",
          "price": 12.99,
          "stars": 4.6,
          "category": "Classics",
          "publisher": "Chatto & Windus",
          "isbn": "978-0486280615",
          "img": "https://images-na.ssl-images-amazon.com/images/I/71tZXgHImML.jpg"
        },
        {
          "id": 49,
          "title": "Heart of Darkness",
          "author": "Joseph Conrad",
          "description": "Heart of Darkness is a novella that explores the darkness within the human soul and the corrupting influence of power. The story follows Marlow, a sailor who travels up the Congo River to meet Kurtz, an ivory trader who has become a god-like figure among the local people. As Marlow journeys deeper into the heart of Africa, he encounters the horrors of colonial exploitation and the moral decay of Kurtz. Conrad's narrative is a haunting examination of imperialism, racism, and the complexities of human nature, challenging readers to confront the darkness within.",
          "price": 8.99,
          "stars": 4.4,
          "category": "Classics",
          "publisher": "Blackwood's Magazine",
          "isbn": "978-0486264646",
          "img": "https://images-na.ssl-images-amazon.com/images/I/81bfk%2BkmHpL.jpg"
        },
        {
          "id": 50,
          "title": "The Old Man and the Sea",
          "author": "Ernest Hemingway",
          "description": "The Old Man and the Sea is a novella that tells the story of Santiago, an aging Cuban fisherman who battles a giant marlin in the Gulf Stream. The story is a powerful exploration of courage, perseverance, and the struggle between man and nature. Hemingway's sparse, yet evocative prose captures the essence of human endurance and the nobility of struggle, even in the face of defeat. The Old Man and the Sea won the Pulitzer Prize and contributed to Hemingway's Nobel Prize in Literature, solidifying its place as a modern classic.",
          "price": 9.99,
          "stars": 4.7,
          "category": "Classics",
          "publisher": "Charles Scribner's Sons",
          "isbn": "978-0684801223",
          "img": "https://images-na.ssl-images-amazon.com/images/I/81jKeO4XcRL.jpg"
        }
      ]
      